app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "gjwWgXWCdLr1di5P6zFw9Q"], ["updated_at", "2020-02-22 16:37:42.725312"], ["id", 3]]
---
  def reset_session_token
    self.session_token = SecureRandom.urlsafe_base64
    self.save!

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", ""], ["LIMIT", 1]]
---
  def self.find_by_credentials(username, password)
    user = User.find_by_username(username)